## 762579868088: Satellite bucket
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.satellite_access_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.satellite_access_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::cbs-satellite-762579868088-access",
              + "arn:aws:s3:::cbs-satellite-762579868088-access/*",
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.satellite_access_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ acl                         = "private" -> "log-delivery-write"
        id                          = "cbs-satellite-762579868088-access"
        tags                        = {
            "CostCentre" = "cbs-762579868088"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.satellite_access_bucket.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = "cbs-satellite-762579868088-access"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.satellite_access_bucket.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "cbs-satellite-762579868088-access" -> (known after apply) # forces replacement
      ~ id                      = "cbs-satellite-762579868088-access" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.s3_replicate"]

9 tests, 8 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
